Repository: vapoursynth/vapoursynth
Catalog: doc/*/about.po
Languages: es

source: About
es: Acerca de

source: VapourSynth is an application for video manipulation. Or a plugin. Or a library. It's hard to tell because it has a core library written in C++ and a Python module to allow video scripts to be created. It came to be when I started thinking about alternative designs for Avisynth and most of it was written over a 3 month period.
es: VapourSynth es una aplicación para la manipulación de video. O un plugin, o una librería. Es duro decirlo porque tiene una librería core escrita en C++ y un módulo Python que permite crear scripts de video. Llegó a ser así cuando empecé a pensar en diseños alternativos para Avisynth escribiendo la mayor parte en 3 meses.

source: The software has been heavily inspired by `Avisynth <http://www.avisynth.org>`_ and aims to be a 21st century rewrite, taking advantage of the advancements computers have made since the late 90s. The main features compared to Avisynth are:
es: El software está muy influenciado por `Avisynth <http://www.avisynth.org>`_ y pretende ser una reescritura del siglo 21, aprovechando el avance que se ha producido en la computación desde los años 90. Las principales características comparadas con Avisynth, son:

source: Multithreaded - Frame level multithreading that scales well
es: Multithreaded - Multihilo a nivel de fotograma que es escalable

source: Generalized Colorspaces - New colorspaces can be specified at runtime
es: Espacios de color generalizados - Nuevos espacios de color pueden ser especificados en tiempo de ejecución

source: Per Frame Properties - Additional metadata can be attached to frames
es: Propiedades por fotograma - Metadatos adicionales pueden ser anexados a los fotogramas

source: Python Based - The scripting part is implemented as a Python module so you don't have to learn a special language
es: Basado en Python - La parte de scripting está implementando como un módulo Python para que no tengas que aprender un lenguaje especial

source: Support for video with format changes - Some video just can't stick to one format or frame size. VapourSynth can handle any kind of change
es: Soporte para video con cambios de formato - Sólo algunos videos no se ciñen a un formato o tamaño de fotograma. VapourSynth pueden manejar cualquier tipo de cambio

source: Compatible with a large number of already existing Avisynth plugins
es: Compatible con un gran número de los existentes plugins de Avisynth

source: About the author
es: Acerca del autor

source: Fredrik Mellbin majored in electrical engineering with a focus on image analysis and processing with medical applications. He has previously worked with digital electronics and likes to plan his own software projects in his spare time. When he one day found himself out of work he needed something to do between sending out job applications and waiting for a reply. The natural choice for the author was to try to improve Avisynth, the software that once made him interested in video editing. VapourSynth is the result of all that time waiting.
es: Fredrik Mellbin se graduó en ingeniería eléctrica enfocándose al análisis y procesamiento de imagen con fines médicos. Anteriormente, estuvo trabajando con electrónica digital y le gusta planificar sus propios proyectos de software en su tiempo libre. Un día se vio sin trabajo y necesitó matar el tiempo mientras esperaba a que le contestasen a sus solicitudes de empleo. La elección lógica para el autor fue mejorar Avisynth, el software que le hizo interesarse por la edición de video. Vapoursynth es el resultado de todo ese tiempo de espera.

source: Feel free to contact me at fredrik.mellbin that round thingy with an a gmail.com if you need help to port a filter or want to sponsor the development.
es: Siéntete libre para contactar conmigo en fredrik.mellbin junto con una arroba gmail.com si necesitas ayuda para portar un filtro o quieres financiar el desarrollo.
